jmeter.log
2025-09-03 14:42:27,300 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-09-03 14:42:27,333 INFO o.a.j.JMeter: Loading user properties from: C:\Program Files\apache-jmeter-5.6.3\bin\user.properties
2025-09-03 14:42:27,334 INFO o.a.j.JMeter: Loading system properties from: C:\Program Files\apache-jmeter-5.6.3\bin\system.properties
2025-09-03 14:42:27,350 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-09-03 14:42:27,350 INFO o.a.j.JMeter: Version 5.6.3
2025-09-03 14:42:27,350 INFO o.a.j.JMeter: java.version=17.0.13
2025-09-03 14:42:27,350 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-09-03 14:42:27,350 INFO o.a.j.JMeter: os.name=Windows 11
2025-09-03 14:42:27,350 INFO o.a.j.JMeter: os.arch=amd64
2025-09-03 14:42:27,351 INFO o.a.j.JMeter: os.version=10.0
2025-09-03 14:42:27,351 INFO o.a.j.JMeter: file.encoding=Cp1252
2025-09-03 14:42:27,351 INFO o.a.j.JMeter: java.awt.headless=true
2025-09-03 14:42:27,351 INFO o.a.j.JMeter: Max memory     =1073741824
2025-09-03 14:42:27,351 INFO o.a.j.JMeter: Available Processors =12
2025-09-03 14:42:27,370 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-09-03 14:42:27,370 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-09-03 14:42:27,370 INFO o.a.j.JMeter: JMeterHome=C:\Program Files\apache-jmeter-5.6.3
2025-09-03 14:42:27,370 INFO o.a.j.JMeter: user.dir  =D:\JMETER_TESTING\BUZZ_APP_STRESS_TEST
2025-09-03 14:42:27,371 INFO o.a.j.JMeter: PWD       =D:\JMETER_TESTING\BUZZ_APP_STRESS_TEST
2025-09-03 14:42:27,373 INFO o.a.j.JMeter: IP: 192.168.29.22 Name: RAVI FullName: RAVI
2025-09-03 14:42:27,397 INFO o.a.j.s.FileServer: Default base='D:\JMETER_TESTING\BUZZ_APP_STRESS_TEST'
2025-09-03 14:42:27,400 INFO o.a.j.s.FileServer: Set new base='D:\JMETER_TESTING\BUZZ_APP_STRESS_TEST'
2025-09-03 14:42:27,995 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-09-03 14:42:28,141 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-09-03 14:42:28,161 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-09-03 14:42:28,172 INFO o.a.j.s.SaveService: Loading file: BUZZ_WEBSOCKET_WORKING.jmx
2025-09-03 14:42:28,414 INFO o.a.j.JMeter: Creating summariser <summary>
2025-09-03 14:42:28,449 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-09-03 14:42:28,452 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-09-03 14:42:28,452 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-09-03 14:42:28,483 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-09-03 14:42:28,484 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-09-03 14:42:28,597 INFO o.a.j.r.ClassFinder: Will scan jar C:\Program Files\apache-jmeter-5.6.3\lib\ext\jmeter-websocket-samplers-1.3.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-09-03 14:42:28,623 INFO o.a.j.r.ClassFinder: Will scan jar C:\Program Files\apache-jmeter-5.6.3\lib\ext\json-lib-2.4-jdk15.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-09-03 14:42:28,665 INFO o.a.j.r.ClassFinder: Will scan jar C:\Program Files\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-09-03 14:42:28,788 INFO o.a.j.JMeter: Running test (1756890748788)
2025-09-03 14:42:28,822 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : WebSocket Users
2025-09-03 14:42:28,822 INFO o.a.j.e.StandardJMeterEngine: Starting 3 threads for group WebSocket Users.
2025-09-03 14:42:28,822 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-09-03 14:42:28,822 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=3 ramp-up=10 delayedStart=false
2025-09-03 14:42:28,839 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-09-03 14:42:28,839 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-09-03 14:42:28,936 INFO o.a.j.t.JMeterThread: Thread started: WebSocket Users 1-1
2025-09-03 14:42:28,944 INFO o.a.j.s.FileServer: Stored: websocket_test_users.csv
2025-09-03 14:42:32,259 INFO o.a.j.t.JMeterThread: Thread started: WebSocket Users 1-2
2025-09-03 14:42:35,589 INFO o.a.j.t.JMeterThread: Thread started: WebSocket Users 1-3
2025-09-03 14:42:41,994 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-09-03 14:42:41,994 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-09-03 14:42:41,994 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-09-03 14:42:41,995 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-09-03 14:43:02,006 INFO o.a.j.r.Summariser: summary +      6 in 00:00:33 =    0.2/s Avg:   240 Min:     0 Max:   564 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2025-09-03 14:43:34,524 ERROR e.l.j.w.SingleReadWebSocketSampler: Unexpected frame type received in sampler 'Read Call Response': Ping frame with no application data
2025-09-03 14:43:34,526 INFO o.a.j.r.Summariser: summary +      7 in 00:00:33 =    0.2/s Avg:     0 Min:     0 Max:     4 Err:     1 (14.29%) Active: 3 Started: 3 Finished: 0
2025-09-03 14:43:34,527 INFO o.a.j.r.Summariser: summary =     13 in 00:01:06 =    0.2/s Avg:   111 Min:     0 Max:   564 Err:     1 (7.69%)
2025-09-03 14:43:37,869 ERROR e.l.j.w.SingleReadWebSocketSampler: Unexpected frame type received in sampler 'Read Call Response': Ping frame with no application data
2025-09-03 14:43:41,028 ERROR e.l.j.w.SingleReadWebSocketSampler: Unexpected frame type received in sampler 'Read Call Response': Ping frame with no application data
2025-09-03 14:44:00,545 INFO o.a.j.r.Summariser: summary +      6 in 00:00:26 =    0.2/s Avg:     0 Min:     0 Max:     1 Err:     2 (33.33%) Active: 3 Started: 3 Finished: 0
2025-09-03 14:44:00,548 INFO o.a.j.r.Summariser: summary =     19 in 00:01:32 =    0.2/s Avg:    76 Min:     0 Max:   564 Err:     3 (15.79%)
2025-09-03 14:44:13,874 INFO o.a.j.t.JMeterThread: Thread is done: WebSocket Users 1-1
2025-09-03 14:44:13,875 INFO o.a.j.t.JMeterThread: Thread finished: WebSocket Users 1-1
2025-09-03 14:44:16,891 INFO o.a.j.t.JMeterThread: Thread is done: WebSocket Users 1-2
2025-09-03 14:44:16,891 INFO o.a.j.t.JMeterThread: Thread finished: WebSocket Users 1-2
2025-09-03 14:44:20,052 INFO o.a.j.t.JMeterThread: Thread is done: WebSocket Users 1-3
2025-09-03 14:44:20,053 INFO o.a.j.t.JMeterThread: Thread finished: WebSocket Users 1-3
2025-09-03 14:44:20,053 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-09-03 14:44:20,053 INFO o.a.j.s.FileServer: Close: websocket_test_users.csv
2025-09-03 14:44:20,058 INFO o.a.j.r.Summariser: summary +      5 in 00:00:20 =    0.3/s Avg:    63 Min:     0 Max:   316 Err:     2 (40.00%) Active: 0 Started: 3 Finished: 3
2025-09-03 14:44:20,059 INFO o.a.j.r.Summariser: summary =     24 in 00:01:51 =    0.2/s Avg:    73 Min:     0 Max:   564 Err:     5 (20.83%)